{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.1.2", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"config": {"name": "model_1", "layers": [{"name": "input_1", "inbound_nodes": [], "config": {"sparse": false, "name": "input_1", "batch_input_shape": [null, 224, 224, 3], "dtype": "float32"}, "class_name": "InputLayer"}, {"name": "conv1_pad", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"name": "conv1_pad", "data_format": "channels_last", "trainable": true, "padding": [[0, 1], [0, 1]]}, "class_name": "ZeroPadding2D"}, {"name": "conv1", "inbound_nodes": [[["conv1_pad", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 32, "activation": "linear", "use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv1", "strides": [2, 2], "trainable": true, "padding": "valid"}, "class_name": "Conv2D"}, {"name": "conv1_bn", "inbound_nodes": [[["conv1", 0, 0, {}]]], "config": {"gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "epsilon": 0.001, "name": "conv1_bn", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"name": "conv1_relu", "inbound_nodes": [[["conv1_bn", 0, 0, {}]]], "config": {"name": "conv1_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU"}, {"name": "conv_dw_1", "inbound_nodes": [[["conv1_relu", 0, 0, {}]]], "config": {"bias_constraint": null, "data_format": "channels_last", "depthwise_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "linear", "use_bias": false, "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "conv_dw_1", "kernel_size": [3, 3], "strides": [1, 1], "depthwise_regularizer": null, "padding": "same"}, "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_1_bn", "inbound_nodes": [[["conv_dw_1", 0, 0, {}]]], "config": {"gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "epsilon": 0.001, "name": "conv_dw_1_bn", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"name": "conv_dw_1_relu", "inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]], "config": {"name": "conv_dw_1_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU"}, {"name": "conv_pw_1", "inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 64, "activation": "linear", "use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv_pw_1", "strides": [1, 1], "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "conv_pw_1_bn", "inbound_nodes": [[["conv_pw_1", 0, 0, {}]]], "config": {"gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "epsilon": 0.001, "name": "conv_pw_1_bn", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"name": "conv_pw_1_relu", "inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]], "config": {"name": "conv_pw_1_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU"}, {"name": "conv_pad_2", "inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]], "config": {"name": "conv_pad_2", "data_format": "channels_last", "trainable": true, "padding": [[0, 1], [0, 1]]}, "class_name": "ZeroPadding2D"}, {"name": "conv_dw_2", "inbound_nodes": [[["conv_pad_2", 0, 0, {}]]], "config": {"bias_constraint": null, "data_format": "channels_last", "depthwise_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "linear", "use_bias": false, "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "conv_dw_2", "kernel_size": [3, 3], "strides": [2, 2], "depthwise_regularizer": null, "padding": "valid"}, "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_2_bn", "inbound_nodes": [[["conv_dw_2", 0, 0, {}]]], "config": {"gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "epsilon": 0.001, "name": "conv_dw_2_bn", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"name": "conv_dw_2_relu", "inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]], "config": {"name": "conv_dw_2_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU"}, {"name": "conv_pw_2", "inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 128, "activation": "linear", "use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv_pw_2", "strides": [1, 1], "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "conv_pw_2_bn", "inbound_nodes": [[["conv_pw_2", 0, 0, {}]]], "config": {"gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "epsilon": 0.001, "name": "conv_pw_2_bn", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"name": "conv_pw_2_relu", "inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]], "config": {"name": "conv_pw_2_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU"}, {"name": "conv_dw_3", "inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]], "config": {"bias_constraint": null, "data_format": "channels_last", "depthwise_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "linear", "use_bias": false, "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "conv_dw_3", "kernel_size": [3, 3], "strides": [1, 1], "depthwise_regularizer": null, "padding": "same"}, "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_3_bn", "inbound_nodes": [[["conv_dw_3", 0, 0, {}]]], "config": {"gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "epsilon": 0.001, "name": "conv_dw_3_bn", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"name": "conv_dw_3_relu", "inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]], "config": {"name": "conv_dw_3_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU"}, {"name": "conv_pw_3", "inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 128, "activation": "linear", "use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv_pw_3", "strides": [1, 1], "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "conv_pw_3_bn", "inbound_nodes": [[["conv_pw_3", 0, 0, {}]]], "config": {"gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "epsilon": 0.001, "name": "conv_pw_3_bn", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"name": "conv_pw_3_relu", "inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]], "config": {"name": "conv_pw_3_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU"}, {"name": "conv_pad_4", "inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]], "config": {"name": "conv_pad_4", "data_format": "channels_last", "trainable": true, "padding": [[0, 1], [0, 1]]}, "class_name": "ZeroPadding2D"}, {"name": "conv_dw_4", "inbound_nodes": [[["conv_pad_4", 0, 0, {}]]], "config": {"bias_constraint": null, "data_format": "channels_last", "depthwise_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "linear", "use_bias": false, "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "conv_dw_4", "kernel_size": [3, 3], "strides": [2, 2], "depthwise_regularizer": null, "padding": "valid"}, "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_4_bn", "inbound_nodes": [[["conv_dw_4", 0, 0, {}]]], "config": {"gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "epsilon": 0.001, "name": "conv_dw_4_bn", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"name": "conv_dw_4_relu", "inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]], "config": {"name": "conv_dw_4_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU"}, {"name": "conv_pw_4", "inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 256, "activation": "linear", "use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv_pw_4", "strides": [1, 1], "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "conv_pw_4_bn", "inbound_nodes": [[["conv_pw_4", 0, 0, {}]]], "config": {"gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "epsilon": 0.001, "name": "conv_pw_4_bn", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"name": "conv_pw_4_relu", "inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]], "config": {"name": "conv_pw_4_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU"}, {"name": "conv_dw_5", "inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]], "config": {"bias_constraint": null, "data_format": "channels_last", "depthwise_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "linear", "use_bias": false, "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "conv_dw_5", "kernel_size": [3, 3], "strides": [1, 1], "depthwise_regularizer": null, "padding": "same"}, "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_5_bn", "inbound_nodes": [[["conv_dw_5", 0, 0, {}]]], "config": {"gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "epsilon": 0.001, "name": "conv_dw_5_bn", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"name": "conv_dw_5_relu", "inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]], "config": {"name": "conv_dw_5_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU"}, {"name": "conv_pw_5", "inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 256, "activation": "linear", "use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv_pw_5", "strides": [1, 1], "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "conv_pw_5_bn", "inbound_nodes": [[["conv_pw_5", 0, 0, {}]]], "config": {"gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "epsilon": 0.001, "name": "conv_pw_5_bn", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"name": "conv_pw_5_relu", "inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]], "config": {"name": "conv_pw_5_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU"}, {"name": "conv_pad_6", "inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]], "config": {"name": "conv_pad_6", "data_format": "channels_last", "trainable": true, "padding": [[0, 1], [0, 1]]}, "class_name": "ZeroPadding2D"}, {"name": "conv_dw_6", "inbound_nodes": [[["conv_pad_6", 0, 0, {}]]], "config": {"bias_constraint": null, "data_format": "channels_last", "depthwise_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "linear", "use_bias": false, "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "conv_dw_6", "kernel_size": [3, 3], "strides": [2, 2], "depthwise_regularizer": null, "padding": "valid"}, "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_6_bn", "inbound_nodes": [[["conv_dw_6", 0, 0, {}]]], "config": {"gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "epsilon": 0.001, "name": "conv_dw_6_bn", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"name": "conv_dw_6_relu", "inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]], "config": {"name": "conv_dw_6_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU"}, {"name": "conv_pw_6", "inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 512, "activation": "linear", "use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv_pw_6", "strides": [1, 1], "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "conv_pw_6_bn", "inbound_nodes": [[["conv_pw_6", 0, 0, {}]]], "config": {"gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "epsilon": 0.001, "name": "conv_pw_6_bn", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"name": "conv_pw_6_relu", "inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]], "config": {"name": "conv_pw_6_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU"}, {"name": "conv_dw_7", "inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]], "config": {"bias_constraint": null, "data_format": "channels_last", "depthwise_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "linear", "use_bias": false, "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "conv_dw_7", "kernel_size": [3, 3], "strides": [1, 1], "depthwise_regularizer": null, "padding": "same"}, "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_7_bn", "inbound_nodes": [[["conv_dw_7", 0, 0, {}]]], "config": {"gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "epsilon": 0.001, "name": "conv_dw_7_bn", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"name": "conv_dw_7_relu", "inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]], "config": {"name": "conv_dw_7_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU"}, {"name": "conv_pw_7", "inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 512, "activation": "linear", "use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv_pw_7", "strides": [1, 1], "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "conv_pw_7_bn", "inbound_nodes": [[["conv_pw_7", 0, 0, {}]]], "config": {"gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "epsilon": 0.001, "name": "conv_pw_7_bn", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"name": "conv_pw_7_relu", "inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]], "config": {"name": "conv_pw_7_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU"}, {"name": "conv_dw_8", "inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]], "config": {"bias_constraint": null, "data_format": "channels_last", "depthwise_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "linear", "use_bias": false, "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "conv_dw_8", "kernel_size": [3, 3], "strides": [1, 1], "depthwise_regularizer": null, "padding": "same"}, "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_8_bn", "inbound_nodes": [[["conv_dw_8", 0, 0, {}]]], "config": {"gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "epsilon": 0.001, "name": "conv_dw_8_bn", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"name": "conv_dw_8_relu", "inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]], "config": {"name": "conv_dw_8_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU"}, {"name": "conv_pw_8", "inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 512, "activation": "linear", "use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv_pw_8", "strides": [1, 1], "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "conv_pw_8_bn", "inbound_nodes": [[["conv_pw_8", 0, 0, {}]]], "config": {"gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "epsilon": 0.001, "name": "conv_pw_8_bn", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"name": "conv_pw_8_relu", "inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]], "config": {"name": "conv_pw_8_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU"}, {"name": "conv_dw_9", "inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]], "config": {"bias_constraint": null, "data_format": "channels_last", "depthwise_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "linear", "use_bias": false, "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "conv_dw_9", "kernel_size": [3, 3], "strides": [1, 1], "depthwise_regularizer": null, "padding": "same"}, "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_9_bn", "inbound_nodes": [[["conv_dw_9", 0, 0, {}]]], "config": {"gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "epsilon": 0.001, "name": "conv_dw_9_bn", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"name": "conv_dw_9_relu", "inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]], "config": {"name": "conv_dw_9_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU"}, {"name": "conv_pw_9", "inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 512, "activation": "linear", "use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv_pw_9", "strides": [1, 1], "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "conv_pw_9_bn", "inbound_nodes": [[["conv_pw_9", 0, 0, {}]]], "config": {"gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "epsilon": 0.001, "name": "conv_pw_9_bn", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"name": "conv_pw_9_relu", "inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]], "config": {"name": "conv_pw_9_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU"}, {"name": "conv_dw_10", "inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]], "config": {"bias_constraint": null, "data_format": "channels_last", "depthwise_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "linear", "use_bias": false, "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "conv_dw_10", "kernel_size": [3, 3], "strides": [1, 1], "depthwise_regularizer": null, "padding": "same"}, "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_10_bn", "inbound_nodes": [[["conv_dw_10", 0, 0, {}]]], "config": {"gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "epsilon": 0.001, "name": "conv_dw_10_bn", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"name": "conv_dw_10_relu", "inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]], "config": {"name": "conv_dw_10_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU"}, {"name": "conv_pw_10", "inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 512, "activation": "linear", "use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv_pw_10", "strides": [1, 1], "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "conv_pw_10_bn", "inbound_nodes": [[["conv_pw_10", 0, 0, {}]]], "config": {"gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "epsilon": 0.001, "name": "conv_pw_10_bn", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"name": "conv_pw_10_relu", "inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]], "config": {"name": "conv_pw_10_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU"}, {"name": "conv_dw_11", "inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]], "config": {"bias_constraint": null, "data_format": "channels_last", "depthwise_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "linear", "use_bias": false, "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "conv_dw_11", "kernel_size": [3, 3], "strides": [1, 1], "depthwise_regularizer": null, "padding": "same"}, "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_11_bn", "inbound_nodes": [[["conv_dw_11", 0, 0, {}]]], "config": {"gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "epsilon": 0.001, "name": "conv_dw_11_bn", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"name": "conv_dw_11_relu", "inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]], "config": {"name": "conv_dw_11_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU"}, {"name": "conv_pw_11", "inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 512, "activation": "linear", "use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv_pw_11", "strides": [1, 1], "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "conv_pw_11_bn", "inbound_nodes": [[["conv_pw_11", 0, 0, {}]]], "config": {"gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "epsilon": 0.001, "name": "conv_pw_11_bn", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"name": "conv_pw_11_relu", "inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]], "config": {"name": "conv_pw_11_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU"}, {"name": "conv_pad_12", "inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]], "config": {"name": "conv_pad_12", "data_format": "channels_last", "trainable": true, "padding": [[0, 1], [0, 1]]}, "class_name": "ZeroPadding2D"}, {"name": "conv_dw_12", "inbound_nodes": [[["conv_pad_12", 0, 0, {}]]], "config": {"bias_constraint": null, "data_format": "channels_last", "depthwise_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "linear", "use_bias": false, "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "conv_dw_12", "kernel_size": [3, 3], "strides": [2, 2], "depthwise_regularizer": null, "padding": "valid"}, "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_12_bn", "inbound_nodes": [[["conv_dw_12", 0, 0, {}]]], "config": {"gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "epsilon": 0.001, "name": "conv_dw_12_bn", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"name": "conv_dw_12_relu", "inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]], "config": {"name": "conv_dw_12_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU"}, {"name": "conv_pw_12", "inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 1024, "activation": "linear", "use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv_pw_12", "strides": [1, 1], "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "conv_pw_12_bn", "inbound_nodes": [[["conv_pw_12", 0, 0, {}]]], "config": {"gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "epsilon": 0.001, "name": "conv_pw_12_bn", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"name": "conv_pw_12_relu", "inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]], "config": {"name": "conv_pw_12_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU"}, {"name": "conv_dw_13", "inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]], "config": {"bias_constraint": null, "data_format": "channels_last", "depthwise_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "linear", "use_bias": false, "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "conv_dw_13", "kernel_size": [3, 3], "strides": [1, 1], "depthwise_regularizer": null, "padding": "same"}, "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_13_bn", "inbound_nodes": [[["conv_dw_13", 0, 0, {}]]], "config": {"gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "epsilon": 0.001, "name": "conv_dw_13_bn", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"name": "conv_dw_13_relu", "inbound_nodes": [[["conv_dw_13_bn", 0, 0, {}]]], "config": {"name": "conv_dw_13_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU"}, {"name": "conv_pw_13", "inbound_nodes": [[["conv_dw_13_relu", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 1024, "activation": "linear", "use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv_pw_13", "strides": [1, 1], "trainable": true, "padding": "same"}, "class_name": "Conv2D"}, {"name": "conv_pw_13_bn", "inbound_nodes": [[["conv_pw_13", 0, 0, {}]]], "config": {"gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "epsilon": 0.001, "name": "conv_pw_13_bn", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"name": "conv_pw_13_relu", "inbound_nodes": [[["conv_pw_13_bn", 0, 0, {}]]], "config": {"name": "conv_pw_13_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU"}, {"name": "global_average_pooling2d_1", "inbound_nodes": [[["conv_pw_13_relu", 0, 0, {}]]], "config": {"name": "global_average_pooling2d_1", "data_format": "channels_last", "trainable": true}, "class_name": "GlobalAveragePooling2D"}, {"name": "dropout_1", "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "config": {"name": "dropout_1", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.0}, "class_name": "Dropout"}, {"name": "dense_1", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_constraint": null, "units": 10, "trainable": true, "activation": "softmax", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "dense_1", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0]]}, "class_name": "Model"}}, "weightsManifest": [{"paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"], "weights": [{"name": "conv1/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv1_bn/gamma", "shape": [32], "dtype": "float32"}, {"name": "conv1_bn/beta", "shape": [32], "dtype": "float32"}, {"name": "conv1_bn/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "conv1_bn/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_1/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "conv_dw_10/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_10_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_10_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_10_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_10_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_11/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_11_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_11_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_11_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_11_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_12/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_12_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_12_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_12_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_12_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_13/depthwise_kernel", "shape": [3, 3, 1024, 1], "dtype": "float32"}, {"name": "conv_dw_13_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv_dw_13_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv_dw_13_bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv_dw_13_bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv_dw_1_bn/gamma", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_1_bn/beta", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_1_bn/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_1_bn/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_2/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "conv_dw_2_bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_2_bn/beta", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_2_bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_2_bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_3/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "conv_dw_3_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_3_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_3_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_3_bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_4/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "conv_dw_4_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_4_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_4_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_4_bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_5/depthwise_kernel", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "conv_dw_5_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_5_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_5_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_5_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_6/depthwise_kernel", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "conv_dw_6_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_6_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_6_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_6_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_7/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_7_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_7_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_7_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_7_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_8/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_8_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_8_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_8_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_8_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_9/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_9_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_9_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_9_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_9_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_1/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "conv_pw_10/kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "conv_pw_10_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_10_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_10_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_10_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_11/kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "conv_pw_11_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_11_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_11_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_11_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_12/kernel", "shape": [1, 1, 512, 1024], "dtype": "float32"}, {"name": "conv_pw_12_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv_pw_12_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv_pw_12_bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv_pw_12_bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv_pw_13/kernel", "shape": [1, 1, 1024, 1024], "dtype": "float32"}, {"name": "conv_pw_13_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv_pw_13_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv_pw_13_bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv_pw_13_bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv_pw_1_bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv_pw_1_bn/beta", "shape": [64], "dtype": "float32"}, {"name": "conv_pw_1_bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": 